#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.gcr.google_project_service.api["containerregistry.googleapis.com"]: Refreshing state... [id=tbd-2023l-303719/containerregistry.googleapis.com]
module.vpc.module.vpc.module.vpc.google_compute_network.network: Refreshing state... [id=projects/tbd-2023l-303719/global/networks/main-vpc]
module.vpc.module.cloud-router.google_compute_router.router: Refreshing state... [id=projects/tbd-2023l-303719/regions/europe-west1/routers/nat-router]
module.vpc.module.vpc.module.subnets.google_compute_subnetwork.subnetwork["europe-west1/subnet-01"]: Refreshing state... [id=projects/tbd-2023l-303719/regions/europe-west1/subnetworks/subnet-01]
module.vpc.google_compute_firewall.fw-allow-ingress-from-iap: Refreshing state... [id=projects/tbd-2023l-303719/global/firewalls/fw-allow-ingress-iap]
module.vpc.google_compute_firewall.default-internal-allow-all: Refreshing state... [id=projects/tbd-2023l-303719/global/firewalls/default-internal-allow-all]
module.vpc.module.cloud-router.google_compute_router_nat.nats["nat-gateway"]: Refreshing state... [id=tbd-2023l-303719/europe-west1/nat-router/nat-gateway]
module.vpc.module.vpc.module.routes.google_compute_route.route["egress-internet"]: Refreshing state... [id=projects/tbd-2023l-303719/global/routes/egress-internet]
module.dataproc.google_project_service.dataproc: Refreshing state... [id=tbd-2023l-303719/dataproc.googleapis.com]
module.gcr.google_container_registry.registry: Refreshing state... [id=eu.artifacts.tbd-2023l-303719.appspot.com]
module.dataproc.google_dataproc_cluster.tbd-dataproc-cluster: Refreshing state... [id=projects/tbd-2023l-303719/regions/europe-west1/clusters/tbd-cluster]
module.jupyter_docker_image.docker_image.jupyter: Refreshing state... [id=sha256:5b353bac739ec64a5c516d30b48962ab9f55e166e89ecb626bb95f28e20fd37aeu.gcr.io/tbd-2023l-303719/jupyter:3.6.3]
module.jupyter_docker_image.docker_registry_image.jupyterlab: Refreshing state... [id=sha256:70920ade3d5ad67f6ffb5f3dea5cfebe33644be81a388ee8a3928eaee0d49f06]
module.vertex_ai_workbench.google_project_service.notebooks: Refreshing state... [id=tbd-2023l-303719/notebooks.googleapis.com]
module.vertex_ai_workbench.google_storage_bucket.notebook-conf-bucket: Refreshing state... [id=tbd-2023l-303719-conf]
module.vertex_ai_workbench.google_storage_bucket_object.post-startup: Refreshing state... [id=tbd-2023l-303719-conf-scripts/notebook_post_startup_script.sh]
module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding: Refreshing state... [id=b/tbd-2023l-303719-conf/roles/storage.objectViewer]
module.vertex_ai_workbench.google_notebooks_instance.tbd_notebook: Refreshing state... [id=projects/tbd-2023l-303719/locations/europe-west1-b/instances/tbd-2023l-303719-notebook]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.jupyter_docker_image.docker_image.jupyter has been deleted
  - resource "docker_image" "jupyter" {
        id       = "sha256:5b353bac739ec64a5c516d30b48962ab9f55e166e89ecb626bb95f28e20fd37aeu.gcr.io/tbd-2023l-303719/jupyter:3.6.3"
      - name     = "eu.gcr.io/tbd-2023l-303719/jupyter:3.6.3" -> null
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jupyter_docker_image.docker_image.jupyter will be created
  + resource "docker_image" "jupyter" {
      + id          = (known after apply)
      + image_id    = (known after apply)
      + name        = "eu.gcr.io/tbd-2023l-303719/jupyter:3.6.3"
      + repo_digest = (known after apply)
      + triggers    = {
          + "dir_sha1" = "98b5648b76ecb399c72485825db65adcee65fa80"
        }

      + build {
          + build_args   = {
              + "JUPYTERLAB_VERSION" = "3.6.3"
              + "PROJECT_NAME"       = "tbd-2023l-303719"
            }
          + cache_from   = []
          + context      = "modules/docker_image/resources"
          + dockerfile   = "Dockerfile"
          + extra_hosts  = []
          + remove       = true
          + security_opt = []
          + tag          = [
              + "eu.gcr.io/tbd-2023l-303719/jupyter:latest",
            ]
        }
    }

  # module.jupyter_docker_image.docker_registry_image.jupyterlab must be replaced
-/+ resource "docker_registry_image" "jupyterlab" {
      ~ id                   = "sha256:70920ade3d5ad67f6ffb5f3dea5cfebe33644be81a388ee8a3928eaee0d49f06" -> (known after apply)
        name                 = "eu.gcr.io/tbd-2023l-303719/jupyter:3.6.3"
      ~ sha256_digest        = "sha256:70920ade3d5ad67f6ffb5f3dea5cfebe33644be81a388ee8a3928eaee0d49f06" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha1" = "475a14279a86090080f3cba136d75666e87fcc63" -> "98b5648b76ecb399c72485825db65adcee65fa80"
        }
        # (2 unchanged attributes hidden)
    }

  # module.vertex_ai_workbench.data.google_project.project will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_project" "project" {
      + auto_create_network = (known after apply)
      + billing_account     = (known after apply)
      + folder_id           = (known after apply)
      + id                  = (known after apply)
      + labels              = (known after apply)
      + name                = (known after apply)
      + number              = (known after apply)
      + org_id              = (known after apply)
      + project_id          = "tbd-2023l-303719"
      + skip_delete         = (known after apply)
    }

  # module.vertex_ai_workbench.google_project_iam_binding.token_creator_role will be created
  + resource "google_project_iam_binding" "token_creator_role" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + members = (known after apply)
      + project = "tbd-2023l-303719"
      + role    = "roles/iam.serviceAccountTokenCreator"
    }

  # module.vertex_ai_workbench.google_storage_bucket_iam_binding.binding will be updated in-place
  ~ resource "google_storage_bucket_iam_binding" "binding" {
        id      = "b/tbd-2023l-303719-conf/roles/storage.objectViewer"
      ~ members = [
          - "serviceAccount:845602035754-compute@developer.gserviceaccount.com",
        ] -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "iac_service_account" but a
value was found in file "env/project.tfvars". If you meant to use this value,
add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @JarekSmardzewski, Action: `pull_request`, Working Directory: ``, Workflow: `Tech Tests`*